app/controllers/shops_controller.rb

  def index
    @shops = Shop.all
---
SELECT * FROM `shops`

  def show
    @shop = Shop.find(params[:id])
---
SELECT * FROM `shops` WHERE (`shops`.`id` = 1)

  def edit
    @shop = Shop.find(params[:id])
---
SELECT * FROM `shops` WHERE (`shops`.`id` = 1)

  def create
    @shop = Shop.new(params[:shop])

    if @shop.save
---
INSERT INTO `shops` (`name`, `opened`) VALUES('first', 1)

  def update
    @shop = Shop.find(params[:id])

    if @shop.update_attributes(params[:shop])
---
SELECT * FROM `shops` WHERE (`shops`.`id` = 1)
UPDATE `shops` SET `opened` = 0 WHERE `id` = 1